# ///
# bot token: 8431004691:AAG4ApIuiN5vAC2-q7mKLHNRq5GHJwXxQ0s
# ///

import logging

from telegram import (
    Update,                 # /// Update - объект, который содержит всю информацию о входящем сообщении (текст, пользователь, чат и т.д.)
    ReplyKeyboardMarkup,    # /// ReplyKeyboardMarkup - создает клавиатуру с кнопками под полем ввода
    ReplyKeyboardRemove     # /// ReplyKeyboardRemove - убирает кастомную клавиатуру, возвращая стандартную
)

from telegram.ext import (
    Application,            # /// Application - главный класс бота, управляет всеми процессами
    CommandHandler,         # /// CommandHandler - обрабатывает команды (например, /start)
    MessageHandler,         # /// MessageHandler - обрабатывает текстовые сообщения
    ContextTypes,           # /// ContextTypes - типы данных для контекста бота
    ConversationHandler,    # /// ConversationHandler - управляет многошаговыми диалогами
    filters                 # /// filters - фильтры для отбора сообщений по типу
)

# /// настройка логирования 
logging.basicConfig(
    format="%(asctime)s - %(name)s - %(levelname)s - %(message)s",  # /// шаблон вывода логов: время - имя логгера - уровень - сообщение
    level=logging.INFO                                              # /// записывать сообщения уровня INFO и выше (INFO, WARNING, ERROR)
)

BOT_TOKEN = "8431004691:AAG4ApIuiN5vAC2-q7mKLHNRq5GHJwXxQ0s"        # /// Токен от @BotFather

WELCOME, SECOND_STEP, ASK_INFO = range(3)                                     # /// WELCOME = 0, SECOND_STEP = 1


#/// обработчик команды /start
async def start(update: Update, context: ContextTypes.DEFAULT_TYPE) -> int: # /// update - информационный объект, context - объект для хранения данных между вызовами функций, -> int - функция возвращает целое число (состояние диалога)
    welcome_text = "Привет👋\n\
Мы рады, что ты с нами!\n\
Важно: выйди на оформление в 10:00 по адресу: \
г. Минск, пр-т Дзержинского, 104, БЦ «Титан», средняя башня (ст. метро «Петровщина»).\n\
Мы уже подготовили для тебя рабочее место и приятный старт! ☕"
    keyboard = [
        ["Далее"],
        ["Отмена"]
    ]

    reply_markup = ReplyKeyboardMarkup(
        keyboard,                       # /// keyboard - наш массив кнопок,   
        resize_keyboard=True            # /// resize_keyboard=True - автоматически подгонять размер кнопок
    )   

    await update.message.reply_text(    # /// await - ждем завершения отправки сообщения, update.message.reply_text() - отвечает на сообщение пользователя
        welcome_text,                   # /// welcome_text - текст сообщения
        reply_markup=reply_markup       # /// reply_markup=reply_markup - прикрепляем клавиатуру с кнопками
    )

    return WELCOME                      # /// Возвращаем состояние WELCOME, указывая что диалог перешел в этап приветствия


# /// Функция для обработки выбора пользователя
async def welcome_handler(update: Update, context: ContextTypes.DEFAULT_TYPE) -> int:   # /// update - информационный объект, context - объект для хранения данных между вызовами функций, -> int - функция возвращает целое число (состояние диалога)
    user_choice = update.message.text   # /// Получаем текст сообщения, которое отправил пользователь
    if user_choice == "Далее":
        second_text = "\
Пожалуйста, возьми с собой:\n\
•	Фото (1 шт маленькая)\n\
•	Паспорт\n\
•	Страховая карточка ФСЗН (зеленая)\n\
•	Дипломы\n\
•	Трудовая книжка\n\
•	Свидетельства о рождении детей (до 18 лет)\n\
•	Справка с места учебы ребенка (если более 18 лет)\n\
•	Сертификаты 1С (если есть)\n\
•	Военный билет\n\
•	Счет БелВэб Банка (если есть).\n\
Ближайший адрес банка к нашему офису пр-т Дзержинского, 122. Можно оставить онлайн-заявку AS.Yadkovskij@belveb.by\
"
        keyboard = [
            ["О себе"],
            ["В начало..."]
        ]

        reply_markup = ReplyKeyboardMarkup(
            keyboard,                       # /// Массив кнопок                       
            resize_keyboard=True            # /// Подгоняем размер кнопок
        )

        await update.message.reply_text(
            second_text,                    # /// Текст сообщения для второй страницы
            reply_markup=reply_markup       # /// Крепим клавиатуру с кнопками
        )

        return SECOND_STEP                  # /// Переходим в состояние SECOND_STEP (второй шаг диалога)

    elif user_choice == "Отмена":      # /// Проверка на ввод
        await update.message.reply_text(  # /// Отправляем сообщение о прерывании
            "Возврат в главное меню. Отправь /start чтобы начать занаво.",
            reply_markup=ReplyKeyboardRemove()  # /// Убираем клавиатуру
        )
    
        return ConversationHandler.END      # /// Заврешаем диалог


# /// Функция для обработки SECOND_STEP
async def second_step_handler(update: Update, context: ContextTypes.DEFAULT_TYPE) -> int:
    user_choice = update.message.text       # /// Получаем текст сообщения от пользователя

    if user_choice == "О себе":        # /// Проверка на ввод
        await update.message.reply_text("\
Чтобы команда быстрее тебя узнала — расскажи пару слов о себе! 😊\n\
Например:\n\
— Чем увлекаешься вне работы?\n\
— Какой у тебя опыт?\n\
— Что тебя вдохновляет?\n\
Чтобы подготовить для тебя корпоративную почту и доступы, пришли, пожалуйста:\n\
— ФИО латиницей\n\
— Дата рождения (в формате ДД.ММ.ГГГГ)\n\
            ",
        reply_markup=ReplyKeyboardRemove(),
        )
        # return await start(update, context) # /// Вызываем функцию start()
        return ASK_INFO
    
    elif user_choice == "В начало...":      # /// Проверка на ввод
        await update.message.reply_text(    # /// Отправляем сообщение
            "Диалог завершен. Для начала нового диалога отправьте /start",
            reply_markup=ReplyKeyboardRemove()  # /// Убираем клавиатуру
        )
    
        return ConversationHandler.END      # /// Завершаем диалог


async def ask_info_handler(update: Update, context: ContextTypes.DEFAULT_TYPE) -> int:
    user_text = update.message.text
    username = update.message.from_user.username
    uid = update.message.from_user.id

    # Кому отправлять сообщение*
    target_username = 7196767339 # 7196767339 - HR, 535431808 - me

    message_to_send = f"Новая информация от @{username} (ID: {uid}):\n\n{user_text}"

    try:
        await context.bot.send_message(
            chat_id=target_username,
            text=message_to_send,      
        )
        await update.message.reply_text("Спасибо! Информация отправлена к HR!😊\nДиалог завершен. Чтобы продолжить введите в чат: /start")
    except Exception as e:
        await update.message.reply_text("Ошибка отпраавки")
        print(e)
    
    return ConversationHandler.END

# /// Функция для отмены диалога
async def cancel(update: Update, context: ContextTypes.DEFAULT_TYPE) -> int:
    await update.message.reply_text(        # /// Отправляем сообщение
        "Диалог завершен. Чтобы продолжить введите в чат: /start",
        reply_markup=ReplyKeyboardRemove()  # /// Убираем клавиатуру
    )

    return ConversationHandler.END


# /// Функция-оброботчик неизвестных обращений
async def handle_unknown(update: Update, context: ContextTypes.DEFAULT_TYPE) -> int:
    await update.message.reply_text(        # /// Отправляем сообщение
        "Используйте кнопки для навигации под чатом или напишите в чат: /start"
    )


# /// Функция main() - главная функция бота
def main() -> None:
    application = Application.builder().token(BOT_TOKEN).build()    # /// Создаем объект Application, Application.builder() - начинаем сборку приложения, .token(BOT_TOKEN) - передаем токен бота, .build() - завершаем сборку и создаем объект
    conv_handler = ConversationHandler(
        entry_points=[CommandHandler("start", start)],              # /// entry_points - точки входа в диалог (команда /start вызывает функцию start)
    
        states={
            WELCOME: [
                MessageHandler(filters.Text(["Далее", "Отмена"]), welcome_handler)  # /// В состоянии WELCOME обрабатываем только тексты "Далее" и "Отмена" функцией welcome_handler
            ],
            SECOND_STEP: [
                MessageHandler(filters.Text(["О себе","В начало..."]), second_step_handler)  # /// В состоянии SECOND_STEP обрабатываем только тексты "Назад" и "В начало..." функцией second_step_handler
            ],
            ASK_INFO: [
                MessageHandler(filters.TEXT & ~filters.COMMAND, ask_info_handler)
            ]
        },

        fallbacks=[CommandHandler("cancel", cancel)]    # /// Обработчик для выхода из диалога 
    )
    application.add_handler(conv_handler)   # /// Добавляем обработчик диалога в приложение(application)
    application.add_handler(MessageHandler(filters.ALL, handle_unknown))    # /// Добавляем обработчик для всех остальных дилогов в приложение(application)
    print("Bot is starting...")
    application.run_polling()   # /// Запускаем приложение в режиме поллинг(Постоянный опрос сервера Telegram)

if __name__ == "__main__":
    main()

        

